#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `failure`
#### Terraform Validation 🤖 `success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.application.data.azuread_application.application: Reading...
module.resource_group.azurerm_resource_group.resource_group: Refreshing state... [id=/subscriptions/0f6b5c8e-cc15-4af4-ba60-40aa8301955e/resourceGroups/indok-web-production]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1hZTkyMzIxOC03NzQ1LTQ2MmEtOGE4Zi05YzM2N2RmMDExNTk7b2JqZWN0SWQ9YjQ0OWExZjMtMzI4ZC00NTQ4LThhYjEtNmUxZGMwNDhlZGZmO3N1YnNjcmlwdGlvbklkPTBmNmI1YzhlLWNjMTUtNGFmNC1iYTYwLTQwYWE4MzAxOTU1ZTt0ZW5hbnRJZD1mMTdhY2Y1Ni1hYjEzLTQzZmEtYjlkNy1mMGUwZDYyODMyNmM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.github.github_actions_environment_secret.azure_client_secret will be created
  + resource "github_actions_environment_secret" "azure_client_secret" {
      + created_at      = (known after apply)
      + environment     = "indok-web-production"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "AZURE_CLIENT_SECRET"
      + updated_at      = (known after apply)
    }

  # module.github.github_actions_environment_secret.azure_subscription_id will be created
  + resource "github_actions_environment_secret" "azure_subscription_id" {
      + created_at      = (known after apply)
      + environment     = "indok-web-production"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "AZURE_SUBSCRIPTION_ID"
      + updated_at      = (known after apply)
    }

  # module.github.github_actions_environment_secret.azure_tenant_id will be created
  + resource "github_actions_environment_secret" "azure_tenant_id" {
      + created_at      = (known after apply)
      + environment     = "indok-web-production"
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "serverless"
      + secret_name     = "AZURE_TENANT_ID"
      + updated_at      = (known after apply)
    }

  # module.github.github_repository_environment.environment will be created
  + resource "github_repository_environment" "environment" {
      + environment = "indok-web-production"
      + id          = (known after apply)
      + repository  = "serverless"
    }

  # module.key_vault.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

Plan: 5 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @larwaa, Action: `pull_request`*